In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('train.csv')
print(df.shape)
df.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
group = pd.pivot_table(df, index='Survived', columns='Sex', values='Age', aggfunc='mean', fill_value=0)
group

Sex          female       male
Survived
0         25.046875  31.618056
1         28.847716  27.276022

**二重カラム**をなくす

In [4]:
group = group.reset_index()
group

Sex  Survived     female       male
0           0  25.046875  31.618056
1           1  28.847716  27.276022

列を並び替える（誤った列名の変更をしないよう、事前に `group.columns` で指定する列順と合わせておく）

In [5]:
group = group[['Survived', 'male', 'female']]
group

Sex  Survived       male     female
0           0  31.618056  25.046875
1           1  27.276022  28.847716

**インデックス名**をリセットする

In [6]:
group.columns = ['Survived', 'male', 'female']
group

   Survived       male     female
0         0  31.618056  25.046875
1         1  27.276022  28.847716